[Rainmeter]
Update=-1
AccurateText=0
DynamicWindowSize=0
Group=ToggleByAssistBtn

[Metadata]
Name=Rhodes_Island_UI
Author=热心炎国云玩家
Information=让您在PC上也能享受到罗德岛终端系统的交互界面。|边角图标按钮。
License=Closure Commons 署名-不许获利-传递下去 42.0
Version=0.9.0

[Variables]
@Include1=#@#GlobalVars.inc


;暗角
[BtnCornerContainer]
Meter=Shape
Shape=Rectangle 0,0,740,140 | StrokeWidth 0

[BtnCornerVtg]
Meter=Shape
Shape=Rectangle 0,-50,880,200 | StrokeWidth 0 | Fill LinearGradient Fill
Fill=260 | #OverlayBGColor#,200 ; 0 | 0,0,0,0 ; 0.5 | 0,0,0,0 ; 1
Container=BtnCornerContainer


;按钮 "她摁下按钮后会发生很多事情，但其中绝对不包括爆炸。"
[BtnCorner]
ImageTint=#OverlayFGColor#
X=6R
Y=0r
H=76
LeftMouseDownAction=[Play #BtnSound#]

[BtnCorner1]
Meter=Image
MeterStyle=BtnCorner
ImageName=#BtnCorner1Icon#
X=12
Y=(12+#BtnCornerIconOffsetY#)
LeftMouseUpAction=#BtnCorner1Action#

[BtnCorner2]
Meter=Image
MeterStyle=BtnCorner
ImageName=#BtnCorner2Icon#
LeftMouseUpAction=#BtnCorner2Action#

[BtnCorner3]
Meter=Image
MeterStyle=BtnCorner
ImageName=#BtnCorner3Icon#
LeftMouseUpAction=#BtnCorner3Action#

[BtnCorner4]
Meter=Image
MeterStyle=BtnCorner
ImageName=#BtnCorner4Icon#
LeftMouseUpAction=#BtnCorner4Action#